
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8670673763)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_storage_bucket_access_control.public_image_bucket
* Update
  * google_storage_bucket.public_image_bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
      ~ uniform_bucket_level_access = true -> false
        # (13 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # google_storage_bucket_access_control.public_image_bucket will be created
  + resource "google_storage_bucket_access_control" "public_image_bucket" {
      + bucket = "lgtm-public-image-bucket"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":4,"Program":"tfcmt","SHA1":"e574f447ea82888724e4bc9ab5b9e78d965a7bbd","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->